In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

ser1 = Series(np.arange(3),index=['A','B','C'])

In [2]:
ser1

NameError: name 'ser1' is not defined

In [3]:
ser1 = Series(np.arange(3),index=['A','B','C'])

In [4]:
ser1

A    0
B    1
C    2
dtype: int64

In [5]:
# Drop entry according to index

ser1.drop('B')

A    0
C    2
dtype: int64

In [6]:
dframe = DataFrame(np.arange(9).reshape(3,3),index=['SF','LA','NY'], columns= ['pop','size','year'])

In [7]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [9]:
# drop
dframe.drop('LA') #does not permanantly change dframe, see below

    pop  size  year
SF    0     1     2
NY    6     7     8

In [10]:
dframe

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [11]:
dframe2 = dframe.drop('LA')

In [12]:
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [13]:
# DROPPING A COLUMN IS A LITTLE TRICKIER

dframe.drop('year',axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7